driver-tests/bpelse/SchemaElemDecl/BPwithNestedElemQualCompApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpw="http://xml.netbeans.org/schema/BPwithNestedElemQualifiedSchema">
  <soapenv:Body>
    <bpw:NestedMsgElem>
      <bpw:Name>ElementFormDefault Qualified</bpw:Name>
      <bpw:msg>
        <bpw:msgId>105</bpw:msgId>
        <bpw:msgStr>Sending Msg5</bpw:msgStr>
      </bpw:msg>
    </bpw:NestedMsgElem>
  </soapenv:Body>
</soapenv:Envelope>