driver-tests/bpelse/SchemaElemDecl/BPwithNestedElemQualifiedCompApp/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://xml.netbeans.org/schema/BPwithNestedElemQualifiedSchema" xmlns="http://xml.netbeans.org/schema/BPwithNestedElemQualifiedSchema">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <NestedMsgElem xmlns="http://xml.netbeans.org/schema/BPwithNestedElemQualifiedSchema">
    <ns0:Name xmlns:ns0="http://xml.netbeans.org/schema/BPwithNestedElemQualifiedSchema">ElementFormDefault Qualified</ns0:Name>
    <ns0:msg xmlns:ns0="http://xml.netbeans.org/schema/BPwithNestedElemQualifiedSchema">
      <ns0:msgId>105</ns0:msgId>
      <ns0:msgStr>Sending Msg5 Added in BPEL BPWithNestedElem Qualified</ns0:msgStr>
    </ns0:msg>
  </NestedMsgElem>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
