driver-tests/bpelse/SchemaElemDecl/BPwithNestedElemQualifiedCompApp/test/results/TestCase1/Actual_20130326142551_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <NestedMsgElem xmlns="http://xml.netbeans.org/schema/BPwithNestedElemQualifiedSchema" xmlns:msgns="http://j2ee.netbeans.org/wsdl/BPwithNestedElemQualified">
      <Name>ElementFormDefault Qualified</Name>
      <msg>
        <msgId>105</msgId>
        <msgStr>Sending Msg5 Added in BPEL BPWithNestedElem Qualified</msgStr>
      </msg>
    </NestedMsgElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>